src/Documents/МаршрутныйЛист/МаршрутныйЛист.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>МаршрутныйЛист</name>
  <registerRecords>AccumulationRegister.ТранспортнаяЛогистикаДоставка</registerRecords>
  <attributes>
    <name>ДокументЛогистики</name>
    <type>
      <types>DocumentRef.ТранспортнаяЛогистика</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Маршрут</name>
    <type>
      <types>CatalogRef.Маршруты</types>
    </type>
  </attributes>
  <attributes>
    <name>Водитель</name>
    <type>
      <types>CatalogRef.Водители</types>
    </type>
  </attributes>
  <attributes>
    <name>Автомобиль</name>
    <type>
      <types>CatalogRef.Автомобили</types>
    </type>
  </attributes>
  <attributes>
    <name>Пробег</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Рейсы</name>
    <attributes>
      <name>Рейс</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РейсПредставление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Тоннаж</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Наценка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СоставыРейсов</name>
    <attributes>
      <name>Рейс</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерВРейсе</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТочкаМаршрута</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>АдресJSON</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>АдресПредставление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>GUID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Тоннаж</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Наценка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДокументыМаршрута</name>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef.Доверенность</types>
        <types>DocumentRef.СчетНаОплатуПокупателю</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументОтгрузки</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>Тоннаж</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Наценка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>GUID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/AccumulationRegisters/ТранспортнаяЛогистикаДоставка/ТранспортнаяЛогистикаДоставка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ТранспортнаяЛогистикаДоставка</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Тоннаж</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>АдресПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяЛогистикиНачало</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяЛогистикиОкончание</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пробег</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Маршрут</name>
    <type>
      <types>CatalogRef.Маршруты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Водитель</name>
    <type>
      <types>CatalogRef.Водители</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Автомобиль</name>
    <type>
      <types>CatalogRef.Автомобили</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Рейс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерВРейсе</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ТочкаМаршрута</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументДвижения</name>
    <type>
      <types>DocumentRef.Доверенность</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/Enums/Базар_ВидыДвиженийМногооборотнойТары/Базар_ВидыДвиженийМногооборотнойТары.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Базар_ВидыДвиженийМногооборотнойТары</name>
  <enumValues>
    <name>Передача</name>
  </enumValues>
  <enumValues>
    <name>Прием</name>
  </enumValues>
  <enumValues>
    <name>Перемещение</name>
  </enumValues>
  <enumValues>
    <name>ВозвратПоставщику</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/НастройкиАвтоматическойПечатиБазовые/НастройкиАвтоматическойПечатиБазовые.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>НастройкиАвтоматическойПечатиБазовые</name>
  <attributes>
    <name>ОбъектМетаданных</name>
    <type>
      <types>CatalogRef.ИдентификаторыОбъектовМетаданных</types>
      <types>CatalogRef.ИдентификаторыОбъектовРасширений</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КомандыПечати</name>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МенеджерПечати</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоКопий</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/ДополнительныеОтчетыИОбработки/ДополнительныеОтчетыИОбработки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="92707138-5004-4378-8477-f909166d319d">
  <name>ДополнительныеОтчетыИОбработки</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="ffd987e3-e8af-4d46-881e-1e312e74dbac">
    <name>ИмяОбъекта</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>256</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <tabularSections extendedConfigurationObject="7a34f723-cd14-4949-a40f-7ce579bf0449">
    <name>Назначение</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="5cdc9ac7-bba9-4ed1-845a-607976fc4679">
      <name>ОбъектНазначения</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="0481bc65-6a32-46b9-ae87-993ba52a29a5">
    <name>Команды</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="36ebebbb-dff1-4dbd-870b-58bd4a71fa1f">
      <name>Идентификатор</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>100</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Documents/МаршрутныйЛист/Forms/ФормаГрупповойРаспечатки/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ Объект.Проведен тогда
		Сообщить("Документ " + Объект.Ссылка + " не проведен! Автоматическая печать документов невозможна!");
		Отказ = Истина;
		Возврат
	КонецЕсли;
	
	СформироватьДеревоПечатныхФорм();
	
КонецПроцедуры

&НаСервере
Процедура СформироватьДеревоПечатныхФорм()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Маршрут", Объект.Маршрут);
	Запрос.УстановитьПараметр("Дата", Объект.Дата);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТранспортнаяЛогистикаДоставкаОбороты.Рейс КАК Рейс,
	|	ТранспортнаяЛогистикаДоставкаОбороты.НомерВРейсе КАК НомерВРейсе,
	|	ТранспортнаяЛогистикаДоставкаОбороты.ТочкаМаршрута КАК Грузополучатель,
	|	ТранспортнаяЛогистикаДоставкаОбороты.ДокументДвижения КАК Документ,
	|	ТранспортнаяЛогистикаДоставкаОбороты.ДокументДвижения.ДоговорКонтрагента КАК ДоговорКонтрагента
	|ИЗ
	|	РегистрНакопления.ТранспортнаяЛогистикаДоставка.Обороты(НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ), КОНЕЦПЕРИОДА(&Дата, ДЕНЬ), , Маршрут = &Маршрут) КАК ТранспортнаяЛогистикаДоставкаОбороты
	|
	|УПОРЯДОЧИТЬ ПО
	|	Рейс,
	|	НомерВРейсе,
	|	Грузополучатель,
	|	Документ";
	
	ВыборкаДокументов = Запрос.Выполнить().Выбрать();
	
	
	ДеревоЗначений = РеквизитФормыВЗначение("ДеревоПечатныхФорм");
	
	// Создаем печатные формы документа "Маршрутный лист"
	СтрокаМаршрута = ДеревоЗначений.Строки.Добавить();
	СтрокаМаршрута.Группировка = Объект.Ссылка;
	
	НастройкиПечати = НастройкиПечатиОбъекта(Неопределено, Объект.Ссылка);
	Если НЕ НастройкиПечати.Владелец = Неопределено тогда
		СоздатьПечатныеФормыСтрокиДерева(Объект.Ссылка, НастройкиПечати, СтрокаМаршрута);
	КонецЕсли;
	
	// Создаем печатные формы документа "Движение многооборотной тары"
	ВидОперации = Перечисления.Базар_ВидыДвиженийМногооборотнойТары.Передача;
	ДвиженияМногооборотнойТары = МногооборотнаяТараСервер.НайтиДвиженияМногооборотнойТарыНаОсновании(Объект.Ссылка, ВидОперации);
	Если НЕ ДвиженияМногооборотнойТары = Неопределено тогда
		ДокументСсылка = ДвиженияМногооборотнойТары.Получить(0);
		НастройкиПечати = НастройкиПечатиОбъекта(Неопределено, ДокументСсылка);
		Если НЕ НастройкиПечати.Владелец = Неопределено тогда
			СоздатьПечатныеФормыСтрокиДерева(ДокументСсылка, НастройкиПечати, СтрокаМаршрута);
		КонецЕсли;
	КонецЕсли;
	
	ПрошлыйГрузополучатель = Неопределено;
	Пока ВыборкаДокументов.Следующий() цикл
		
		Если ПрошлыйГрузополучатель <> ВыборкаДокументов.Грузополучатель тогда
			СтрокаГрузополучатель = СтрокаМаршрута.Строки.Добавить();
			СтрокаГрузополучатель.Группировка = ВыборкаДокументов.Грузополучатель;
		КонецЕсли;
		
		НастройкиПечати = НастройкиПечатиОбъекта(ВыборкаДокументов.ДоговорКонтрагента, ВыборкаДокументов.Документ);
		Если НЕ НастройкиПечати.Владелец = Неопределено тогда
			
			СтрокаДокумент = СтрокаГрузополучатель.Строки.Добавить();
			СтрокаДокумент.Группировка = ВыборкаДокументов.Документ;
			
			СоздатьПечатныеФормыСтрокиДерева(ВыборкаДокументов.Документ, НастройкиПечати, СтрокаДокумент);
			
		КонецЕсли;
		
		ПрошлыйГрузополучатель = ВыборкаДокументов.Грузополучатель;
		
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(ДеревоЗначений,"ДеревоПечатныхФорм");
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция НастройкиПечатиОбъекта(Владелец, Ссылка)
	
	ОбъектМетаданных = НастройкиАвтоматическойПечатиСервер.НайтиОбъектМетаданныхПоСсылке(Ссылка);
	
	СписокОбъектовМетаданных = НастройкиАвтоматическойПечатиСервер.СписокОбъектовМетаданных(Ложь);
	
	Если СписокОбъектовМетаданных.НайтиПоЗначению(ОбъектМетаданных) = Неопределено тогда // Это только базовые настройки печати
		НастрокиПечати = НастройкиАвтоматическойПечатиСервер.НастройкиАвтоматическойПечатиОбъектаМетаданных(ПредопределенноеЗначение("Справочник.НастройкиАвтоматическойПечатиБазовые.ПустаяСсылка"),
		                                                                                                    ОбъектМетаданных);
	Иначе
		НастрокиПечати = НастройкиАвтоматическойПечатиСервер.НастройкиАвтоматическойПечатиОбъектаМетаданных(Владелец,
		                                                                                                    ОбъектМетаданных);
	КонецЕсли;
	
	Возврат НастрокиПечати;
	
КонецФункции

&НаСервере
Процедура СоздатьПечатныеФормыСтрокиДерева(Ссылка, НастройкиПечати, СтрокаДерева)
	
	Для Каждого КомандаПечати из НастройкиПечати.КомандыПечати цикл
		
		СтрокаКомандаПечати = СтрокаДерева.Строки.Добавить();
		СтрокаКомандаПечати.Документ      = Ссылка;
		СтрокаКомандаПечати.Группировка   = КомандаПечати.Представление;
		СтрокаКомандаПечати.Копий         = КомандаПечати.КоличествоКопий;
		СтрокаКомандаПечати.КомандаПечати = КомандаПечати;
		
		ВременныйТабДокумент = Неопределено;
		Если КомандаПечати.МенеджерПечати = "СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки" тогда
			ВременныйТабДокумент = ПолучитьВнешнююПечатнуюФормуНаСервере(КомандаПечати.МенеджерПечати,
			                                                             КомандаПечати.Имя,
			                                                             Ссылка);
		Иначе
			ВременныйТабДокумент = ПолучитьТиповойТабличныйДокументНаСервере(КомандаПечати.МенеджерПечати,
			                                                                 КомандаПечати.Имя,
			                                                                 Ссылка);
		КонецЕсли;
		
		Если НЕ ВременныйТабДокумент = Неопределено тогда
			Если ВременныйТабДокумент.ВысотаТаблицы < 1 тогда
				ВременныйТабДокумент = Неопределено;
			КонецЕсли;
		КонецЕсли;
		
		СтрокаКомандаПечати.ТабличныйДокумент = ВременныйТабДокумент;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ФайловаяСистемаКлиент.СоздатьВременныйКаталог(Новый ОписаниеОповещения(
		"ОбработкаОповещенияСоздатьВременныйКаталогФормыИСформироватьPDFФайлы"
		, ЭтаФорма));
		
	ПолучитьСписокПринтеровСистемы();
	Принтер = ПолучитьПринтерПоУмолчанию();
	
КонецПроцедуры

&НаСервере
Функция ПолучитьТиповойТабличныйДокументНаСервере(ИмяМенеджераПечати, ИмяПечатнойФормы, СсылкаНаОбъект)
	
	ПараметрыПечати = Новый Структура;
	МассивОбъектов = Новый Массив;
	МассивОбъектов.Добавить(СсылкаНаОбъект);
	
	ДанныеПечатнойФормы = УправлениеПечатью.СформироватьПечатныеФормы(ИмяМенеджераПечати,
	                                                                  ИмяПечатнойФормы,
	                                                                  МассивОбъектов,
	                                                                  ПараметрыПечати);
	
	Возврат ДанныеПечатнойФормы.КоллекцияПечатныхФорм[0].ТабличныйДокумент;
	
КонецФункции

&НаСервере
Функция ПолучитьВнешнююПечатнуюФормуНаСервере(ИмяМенеджераПечати,ИдентификаторКоманды,СсылкаНаОбъект)
	
	ПараметрыПечати = Новый Структура;
	МассивОбъектов = Новый Массив;
	МассивОбъектов.Добавить(СсылкаНаОбъект);
	
	КоллекцияПечатныхФорм = Неопределено;
	ПараметрыИсточника = Новый Структура;
	ПараметрыИсточника.Вставить("ИдентификаторКоманды",ИдентификаторКоманды);
	ПараметрыИсточника.Вставить("ОбъектыНазначения",МассивОбъектов);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ДополнительныеОтчетыИОбработкиКоманды.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.ДополнительныеОтчетыИОбработки.Команды КАК ДополнительныеОтчетыИОбработкиКоманды
	               |ГДЕ
	               |	ДополнительныеОтчетыИОбработкиКоманды.Идентификатор = &ИдентификаторКоманды";
	
	Запрос.УстановитьПараметр("ИдентификаторКоманды",ИдентификаторКоманды);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		УправлениеПечатью.ПечатьПоВнешнемуИсточнику(Выборка.Ссылка,
		                                            ПараметрыИсточника,
		                                            КоллекцияПечатныхФорм,
		                                            МассивОбъектов,
		                                            ПараметрыПечати);
		
		Если Не КоллекцияПечатныхФорм.Количество() = 0 тогда
			Возврат КоллекцияПечатныхФорм[0].ТабличныйДокумент;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

&НаКлиенте
Процедура ДеревоПечатныхФормПриАктивизацииСтроки(Элемент)
	
	Если Элементы.ДеревоПечатныхФорм.ТекущиеДанные = Неопределено тогда
		ТабДокумент = Новый ТабличныйДокумент;
		Возврат;
	КонецЕсли;
	
	ПодключитьОбработчикОжидания("ОбновитьИзображениеПечФормы",0.2,Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьИзображениеПечФормы() Экспорт
	
	ТабДокумент = Элементы.ДеревоПечатныхФорм.ТекущиеДанные.ТабличныйДокумент;
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьСписокПринтеровСистемы()
	
	СистемнаяИнформация = Новый СистемнаяИнформация;
	СписокПринтеров     = Новый СписокЗначений;
	
	Попытка
		Если Найти(НРег(СистемнаяИнформация.ТипПлатформы), "linux") <> 0 тогда
			LinuxScriptsClient.ExecuteTemplateLinuxScript("list_printers");
			ТекстПринтеров = Новый ЧтениеТекста("/tmp/list-printers.txt", КодировкаТекста.UTF8);
			
			СписокПринтеров.ЗагрузитьЗначения(СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ТекстПринтеров.Прочитать(), " "));
		Иначе
			WScript_Network = Новый COMОбъект("WScript.Network");
			ArrayPrinters   =  WScript_Network.EnumPrinterConnections();
			
			i = 0;
			Пока i < ArrayPrinters.Count()-1 Цикл
				СписокПринтеров.Добавить(ArrayPrinters.Item(i+1));
				i = i + 2;
			КонецЦикла;
		КонецЕсли;
		
	Исключение
		СписокПринтеров.Очистить();
	КонецПопытки;
	
	Элементы.Принтер.СписокВыбора.ЗагрузитьЗначения(СписокПринтеров.ВыгрузитьЗначения());
	
КонецФункции

&НаКлиенте
Функция ПолучитьПринтерПоУмолчанию()
	СистемнаяИнформация = Новый СистемнаяИнформация;
	
	Попытка
		
		Если Найти(НРег(СистемнаяИнформация.ТипПлатформы), "linux") <> 0 тогда
			LinuxScriptsClient.ExecuteTemplateLinuxScript("get_default_printer");
			ТекстПринтеров = Новый ЧтениеТекста("/tmp/printer-default.txt", КодировкаТекста.UTF8);
			Возврат СокрЛП(ТекстПринтеров.Прочитать());
			
		Иначе
			Скрипт = Новый COMОбъект("MSScriptControl.ScriptControl");
			Скрипт.Language = "vbscript";
			Скрипт.AddCode("
		         |Function GetDefaultPrinter()
		         |GetDefaultPrinter=vbNullString
		         |Set objWMIService=GetObject(""winmgmts:"" _
		         |& ""{impersonationLevel=impersonate}!\\.\root\cimv2"")
		         |Set colInstalledPrinters=objWMIService.ExecQuery _
		         |(""Select * from Win32_Printer"")
		         |For Each objPrinter in colInstalledPrinters
		         |If objPrinter.Attributes and 4 Then
		         |GetDefaultPrinter=objPrinter.Name
		         |Exit For
		         |End If
		         |Next
		         |End Function");
			
			Возврат СокрЛП(Скрипт.run("GetDefaultPrinter"));
		КонецЕсли;
		
	Исключение
		Возврат Неопределено;
	КонецПопытки;
	
	Возврат Неопределено;
КонецФункции

&НаКлиенте
Процедура ОбработкаОповещенияСоздатьВременныйКаталогФормыИСформироватьPDFФайлы(ИмяКаталогаВременныхФайлов, ДополнительныеПараметры) Экспорт
	
	КаталогВременныхФайловДокумента = ОбщегоНазначенияКлиентСервер.ДобавитьКонечныйРазделительПути(ИмяКаталогаВременныхФайлов);
	СоздатьPDFФайлыДерева(ДеревоПечатныхФорм);
	
КонецПроцедуры

// Рекурсивная процедура
&НаКлиенте
Процедура СоздатьPDFФайлыДерева(ДеревоПечатныхФорм) Экспорт
	
	Для Каждого СтрокаКомандыПечати из ДеревоПечатныхФорм.ПолучитьЭлементы() цикл
		
		СтрокаКомандыПечати.ФайлPDF = СформироватьPDFФайл(СтрокаКомандыПечати.ПолучитьИдентификатор());
		
		Если СтрокаКомандыПечати.ПолучитьЭлементы().Количество() > 0 тогда
			СоздатьPDFФайлыДерева(СтрокаКомандыПечати);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Функция СформироватьPDFФайл(ИдентификаторСтрокиДерева)
	
	СтрокаДерева = ДеревоПечатныхФорм.НайтиПоИдентификатору(ИдентификаторСтрокиДерева);
	ТабличныйДокумент = СтрокаДерева.ТабличныйДокумент;
	
	Если ТабличныйДокумент = Неопределено тогда
		Возврат "";
	Иначе
		Если ТабличныйДокумент.ВысотаТаблицы < 1 тогда
			Возврат "";
		КонецЕсли;
	КонецЕсли;
	
	UIDФайла = Строка(Новый УникальныйИдентификатор);
	ИмяФайлаСохранения = КаталогВременныхФайловДокумента+UIDФайла+".pdf";
	
	ТабличныйДокумент.Записать(ИмяФайлаСохранения, ТипФайлаТабличногоДокумента.PDF);
	
	Возврат ИмяФайлаСохранения;

КонецФункции

&НаКлиенте
Процедура ОбработкаОповещенияУдалениеВременногоКаталогаФормы(Контекст) Экспорт
		
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	НачатьУдалениеФайлов(Новый ОписаниеОповещения(
		"ОбработкаОповещенияУдалениеВременногоКаталогаФормы"
		, ЭтотОбъект)
		, КаталогВременныхФайловДокумента);
		
КонецПроцедуры

&НаКлиенте
Процедура ПечатьPDFФайла(ДанныеПечатнойФормы, ИмяПринтера)
	
	ПараметрыПечати = Новый Структура;
	ПараметрыПечати.Вставить("Arguments", "" + ИмяПринтера + " """ + ДанныеПечатнойФормы.ФайлPDF + """");
	
	Для Сч = 1 по ДанныеПечатнойФормы.Копий цикл
		LinuxScriptsClient.ExecuteTemplateLinuxScript("print_file",,ПараметрыПечати);
	КонецЦикла;
	
КонецПроцедуры

// Рекурсивная процедура
&НаКлиенте
Процедура РаспечататьПодготовленныеПечатныеФормы(ДеревоПечатныхФорм, ИмяПринтера) Экспорт
	
	Для Каждого Строка из ДеревоПечатныхФорм.ПолучитьЭлементы() цикл
		Если ЗначениеЗаполнено(Строка.ФайлPDF) тогда
			ПечатьPDFФайла(Строка, ИмяПринтера);
		КонецЕсли;
		
		Если Строка.ПолучитьЭлементы().Количество() > 0 тогда
			РаспечататьПодготовленныеПечатныеФормы(Строка, ИмяПринтера);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура АвтоматическаяПечать(Команда)
	
	РаспечататьПодготовленныеПечатныеФормы(ДеревоПечатныхФорм, Принтер);
	
КонецПроцедуры
